In [1]:
import pandas as pd

Q1. List any five functions of the pandas library with execution.

In [2]:
# The First Function which is widely used to import the files that is read_csv , here csv means comma separated files this can be chnaged according to the file type
df = pd.read_csv('https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv')

In [4]:
df.head() #This is another function used to display only first five rows

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [6]:
df.dtypes #This is the function ued to display the datatypes of each column

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [7]:
df.to_csv('stored_titanic.csv') #This to_csv function is used to save the file that we have edited

In [8]:
df.describe() #this function is used to describe the data , that is descripitive analysis

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the 
DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [23]:
data = {'A':['key1','key4','key5'] , 'B':['key2','key6','key7'] , 'C':['key3','key8','key9']}

In [24]:
df = pd.DataFrame(data)

In [25]:
df

      A     B     C
0  key1  key2  key3
1  key4  key6  key8
2  key5  key7  key9

In [30]:
df.reindex([1,3,5])

      A     B     C
1  20.0  50.0  80.0
3   NaN   NaN   NaN
5   NaN   NaN   NaN

                                                                         Or

In [29]:
def reindex_with_incrementation(df):
    new_index = range(1,2*len(df)+1,2)
    df = df.reset_index(drop=True)
    df.index = new_index
    return df
info = {'A':[10,20,30],
        'B':[40,50,60],
        'C':[70,80,90]
       }
df = pd.DataFrame(info)
new_df = reindex_with_incrementation(df)
print(new_df)

    A   B   C
1  10  40  70
3  20  50  80
5  30  60  90

    Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that 
    iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The 
    function should print the sum to the console

In [39]:
def total_sum(df):
    sum_first_three = df['Values'].head(3).sum()
    print('the sum is' , sum_first_three)

In [40]:
data = {'Values':[10,45,32,54,53,23]}

In [42]:
df1 = pd.DataFrame(data)

In [43]:
total_sum(df1)

the sum is 87

Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column 
'Word_Count' that contains the number of words in each row of the 'Text' column.

In [3]:
data = {'Text':["This is the simple text","The is the first text for the count" , "This is the Second Text for the count"]}
df = pd.DataFrame(data)

def count_words(sentence):
    words = sentence.split()
    #the split function will give the count of the words
    return len(words)
df['Word_Count'] = df['Text'].apply(count_words)
print(df)

                                    Text  Word_Count
0                This is the simple text           5
1    The is the first text for the count           8
2  This is the Second Text for the count           8

Q5. How are DataFrame.size() and DataFrame.shape() different?

In [11]:
data = {'A':[1,2,3] , 'B':[4,5,6]}
df = pd.DataFrame(data)
to_size = df.size
df

   A  B
0  1  4
1  2  5
2  3  6

In [10]:
to_size

6

It has return six because it has 3 rows and 2 columns that is 3*2=6

In [13]:
# similarly
data = {'A':[1,2,3] , 'B':[4,5,6]}
df = pd.DataFrame(data)
to_size = df.shape
df
to_size

(3, 2)

it has return (3,2) because it has 3 rows and 2 columns

Q6. Which function of pandas do we use to read an excel file?

we use read_excel function to read a excel file in pandas

Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email 
addresses in the format 'username@domain.com'. Write a Python function that creates a new column 
'Username' in df that contains only the username part of each email address.

The username is the part of the email address that appears before the '@' symbol. For example, if the 
email address is 'john.doe@example.com', the 'Username' column should contain 'john.doe'. Your 
function should extract the username from each email address and store it in the new 'Username' 
column.

In [16]:
import pandas as pd
data = {'Email':['john.doe@example.com' , 'shubham@example.com','mihir@example.com']}
df = pd.DataFrame(data)
def username(email):
    username = email.split('@')[0]
    #this means that split the email address at the '@' symbol and take the first part
    return username
df['Username'] = df['Email'].apply(username)
print(df)

                  Email  Username
0  john.doe@example.com  john.doe
1   shubham@example.com   shubham
2     mihir@example.com     mihir

Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects 
all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The 
function should return a new DataFrame that contains only the selected rows.

In [25]:
data = {"A":[3,8,6,2,9] , "B":[5,2,9,3,1] , "C":[1,7,4,5,2]}
df = pd.DataFrame(data)
def filter_dataframe(info):
    selected_rows = df[(df['A']>5) & (df['B']<10)]
    #to create a new dataframe
    selected_df = pd.DataFrame(selected_rows)
    return selected_df
filter_dataframe(data)

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean, 
median, and standard deviation of the values in the 'Values' column.

In [28]:
data = {'Values':[2,3,4,5,2,32,23,34]}
df = pd.DataFrame(data)
def calculation(info):
    sum_of_values = df['Values'].sum()
    mean_of_values = df['Values'].mean()
    median_of_values = df['Values'].median()
    mode_of_values = df['Values'].mode()
    print("The calculation is" , sum_of_values , mean_of_values , median_of_values , mode_of_values)

In [29]:
calculation(df)

The calculation is 105 13.125 4.5 0    2
Name: Values, dtype: int64

Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to 
create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days 
for each row in the DataFrame. The moving average should be calculated using a window of size 7 and 
should include the current day.

In [2]:
import pandas as pd
def calculate_moving_avg(df):
    #Sort the dataframe values by the 'date'
    df = df.sort_values(by='Date')
    df['MovingAvg']=df['Sales'].rolling(window=7 , min_periods=1).mean()
    return df

In [3]:
df = pd.DataFrame({'Date':['2023-09-01' , '2023-09-02','2023-09-03','2023-09-05' , '2023-09-04' , '2023-09-06','2023-09-07'],'Sales':[100,110,120,130,140,150,160]})
df = calculate_moving_avg(df)
print(df)

         Date  Sales  MovingAvg
0  2023-09-01    100      100.0
1  2023-09-02    110      105.0
2  2023-09-03    120      110.0
4  2023-09-04    140      117.5
3  2023-09-05    130      120.0
5  2023-09-06    150      125.0
6  2023-09-07    160      130.0

Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new 
column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g. 
Monday, Tuesday) corresponding to each date in the 'Date' column

In [7]:
import pandas as pd

def add_weekday_column(df, date_column_name='Date', weekday_column_name='Weekday'):
    # Convert the 'Date' column to a datetime format if it's not already
    df[date_column_name] = pd.to_datetime(df[date_column_name])
    # Extract the weekday name and assign it to the 'Weekday' column
    df[weekday_column_name] = df[date_column_name].dt.strftime('%A')
    return df

In [9]:
#we have the column in which date is given already
df = pd.DataFrame({'Date':['2023-09-17','2023-09-18','2023-09-19','2023-09-21']})
df = add_weekday_column(df)
print(df)

        Date   Weekday
0 2023-09-17    Sunday
1 2023-09-18    Monday
2 2023-09-19   Tuesday
3 2023-09-21  Thursday

Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python 
function to select all rows where the date is between '2023-01-01' and '2023-01-31'.

In [21]:
import pandas as pd

def select_rows_in_date_range(df):
    # Convert the 'Date' column to a datetime format if it's not already
    df['Date'] = pd.to_datetime(df['Date'])
    
    # Define the date range
    start_date = '2023-01-01'
    end_date = '2023-01-31'
    
    # Use boolean indexing to select rows within the date range
    selected_rows = df[(df['Date'] >= start_date) & (df['Date'] <= end_date)]
    
    return selected_rows

# Example usage:
# Assuming you have a DataFrame df with a 'Date' column
df = pd.DataFrame({'Date': ['2023-01-15', '2023-01-25', '2023-02-05', '2023-01-10']})
selected_df = select_rows_in_date_range(df)
print(selected_df)

        Date
0 2023-01-15
1 2023-01-25
3 2023-01-10